Repository: drweb86/butil
Catalog: sources/BUtil.Core/Localization/Resources.*.resx
Languages: it

# Password_Generator_Header
source: Password generator
it: Generatore password

# Button_Cancel
source: Cancel
it: Annulla

# Button_CopyToClipboard
source: Copy
it: Copia

source: Generate
it: Genera

# Password_Field_Length
source: Length:
it: Lunghezza:

source: Options
it: Opzioni

# Password_Group_Header
source: Password (optional)
it: Password (opzionale)

# Password_Field_Confirm
source: Confirm password:
it: Conferma password:

# Password_Use
source: Use
it: Usa

source: Task finished succesfully!
it: Attività completata correttamente!

source: Backup Report
it: Rapporto backup

source: An unexpected error occured Please contact the developers with information saved on your desktop in "{0}" Application will now close
it: Si è verificato un errore imprevisto Contatta gli sviluppatori con le informazioni salvate sul desktop in "{0}" L'applicazione verrà ora chiusa.

source: Packing data in an image
it: Comprimi i dati in un'immagine

source: Get state of source items and storages
it: Ottieni stato elementi sorgenti e archivi

source: Get state of storage
it: Ottieni stato archiviazione

# GetStateOfSourceItem
source: Get state of source item "{0}"
it: Ottieni stato elemento sorgente "{0}"

# GetStateOfFileFileName
source: Get state of file "{0}"
it: Ottieni stato file "{0}"

# WriteStateToStorage
source: Write state
it: Stato scrittura

source: Incremental backup
it: Backup incrementale

# CalculateIncrementedVersionForStorage
source: Calculate incremented version
it: Calcola versione incrementata

# WriteSourceFilesToStorage
source: Write files to storage
it: Scrivi file nell'archivio

# WriteSourceFileToStorage
source: Write file "{0}"
it: Scrivi file "{0}"

source: Write incremented version to storage
it: Scrivi versione incrementata nell'archivio

# WriteIntegrityVerificationScriptsToStorage
source: Write integrity verification scripts
it: Scrivi script verifica integrità

# FolderStorageFailure
source: Storage directory "{0}" was not found. Please update storage settings.
it: Cartella archivio "{0}" non trovata. Aggiorna le impostazioni di archiviazione.

# DeleteUnversionedFilesStorage
source: Delete uncompleted backups from storage
it: Elimina i backup non completati dallo spazio archiviazione

source: Successful
it: Completata

source: Errors
it: Errori

source: Unknown
it: Sconosciuto

# BackupWasPartialDueToStorageQuota
source: Backup was partial. Due to storage quota some files were not copied. Remaining {0} files with of {1} GB.
it: Il backup era parziale. A causa della quota di archiviazione, alcuni file non sono stati copiati. {0} file rimanenti con {1} GB.

source: Import all files
it: Importa tutti i file

# SourceItemDoesNotExist
source: Source item "{0}" does not exist.
it: L'elemento sorgente "{0}" none siste.

source: There are no items to backup!
it: Non ci sono file di cui eseguire il backup!

source: Transform file name is empty.
it: Il nome file trasformazione è vuoto.

source: Folder Storage...
it: Cartella archivio...

source: Destination folder is not specified.
it: Non è stata definita la cartella destinazione.

source: Storage is not specified
it: Non è stato definito l'archivio

source: Host is not be specified.
it: Non è stato definito l'host.

source: Port is invalid.
it: La porta non è valida.

# User_Field_Validation
source: User is not specified.
it: Non è stato definito l'utente.

# Password_Field_Validation_NotSpecified
source: Password is not specified.
it: Non è stata definita la password.

source: Folder does not exist.
it: La cartella non esiste.

source: Invalid transform file name string.
it: Stringa trasformazione nome file non valida.

source: Import "{0}"
it: Importa "{0}"

# Task_Validation_NotSupported
source: This task type is not supported.
it: Questo tipo di attività non è supportato.

source: Finished succesfully
it: Operazione completata correttamente

source: Finished with errors
it: Operazione completata con errori

source: What?
it: Che cosa?

source: Drag and drop here files and folders which you're going to backup!
it: Trascina e rilascia qui i file e le cartelle di cui eseguire il backup!

source: Add folders...
it: Aggiungi cartelle...

source: Remove
it: Rimuovi

source: Add files...
it: Aggiungi file...

source: Where?
it: Dove?

source: Specify the folder where to store back-up:
it: Specifica la cartella in cui archiviare il backup:

source: Encryption
it: Criptazione

source: Logging
it: Registrazione eventi

source: When?
it: Quando?

source: Choose days of week:
it: Scegli i giorni della settimana:

# Days_Wednesday
source: Wednesday
it: Mercoledì

# Days_Thursday
source: Thursday
it: Giovedì

# Days_Friday
source: Friday
it: Venerdì

# Days_Saturday
source: Saturday
it: Sabato

# Days_Tuesday
source: Tuesday
it: Martedì

# Days_Monday
source: Monday
it: Lunedì

# Days_Sunday
source: Sunday
it: Domenica

source: Minute:
it: Minuto:

source: Hour:
it: Ora:

# Task_Create_Hint
source: Creates new task.
it: Crea nuova attività.

# Task_List
source: Tasks
it: Attività

source: Runs backup...
it: Esegui backup...

source: Configurator
it: Configurazione

source: Start
it: Avvia

source: Close
it: Chiudi

source: Wellcome to Backup Wizard!
it: Benvenuto nella procedura guidata backup!

# BackupProcessCompletedSuccesfully
source: Succeeded
it: Completato

source: Elapsed:
it: Trascorso:

source: Backup is in a progress...
it: Il backup è in corso...

# Field_Name
source: Name:
it: Nome:

source: Modify...
it: Modifica

source: Add
it: Aggiungi

source: Destination folder:
it: Cartella destinazione:

# HardDriveStorage
source: Folder storage...
it: Cartella archivio...

source: After completion of backup
it: Dopo il completamento del backup

source: Shutdown PC
it: Spegni il PC

source: Log Off
it: Effettua logoff

source: Do nothing
it: Non fare nulla

source: Items to backup
it: Elementi del backup

source: Recover!
it: Ripristina!

# Password_Recovery_Prompt
source: If your backup is password protected, please type password here:
it: Se il backup è protetto da password, digita qui la password:

source: Continue >
it: Continua >

source: Restoration master
it: Master ripristino

source: Network storages are not allowed to be pointed here!
it: Non è consentito puntare qui gli archivi di rete!

source: Restore Data...
it: Ripristino dati...

source: If you choose something other than 'do nothing' program will configure OS to show you report on next your logon to the system if any errors or warnings will be registered during the backup
it: Se scegli qualcosa di diverso da "non fare nulla", il programma configurerà il sistema operativo per visualizzare, se verranno registrati eventuali errori o avvisi durante il backup, un rapporto al successivo accesso al sistema

source: There are no items to backup! You can specify the data to backup in Configurator in 'What' settings group.
it: Non ci sono elementi di cui eseguire il backup! È possibile specificare i dati di cui eseguire il backup nel Configuratore nel gruppo di impostazioni "Cosa"..

source: Here you may add folders and files you want to backup
it: Qui puoi aggiungere cartelle e file di cui desideri eseguire il backup

source: In this place you can add locations where you would like your backup to be copied after completion of backup
it: Qui puoi aggiungere i percorsi in cui desideri che il backup venga copiato dopo il completamento del backup

source: Here you can set up a scheduler. Shceduler can help you to automate creation of backups
it: Qui puoi impostare una pianificazione. La pianificazione può aiutarti ad automatizzare la creazione dei backup

source: New {0} version is available. Changes are: {1} Program will now open browser with the download page
it: È disponibile la nuova versione {0}. I cambiamenti sono: {1} Il programma ora aprirà il browser puntando alla pagina web per il download

source: Processing State
it: Stato elaborazione

source: Reboot
it: Riavvia

source: BUtil software package component '{0}' is missing. Please reinstall application. Restoration, Backup and Help functions will be unavailable.
it: Componente pacchetto software BUtil '{0}' mancante. Reinstalla l'applicazione. Le funzioni di ripristino, backup e guida non saranno disponibili.

source: Invalid argument(s) passed to the program. Please refer to manual for the complete list of parameters!
it: Argomenti non validi passati al programma. Per l'elenco completo dei parametri fai riferimento al manuale!

source: Help
it: Aiuto

# Task_Field_Name_NewDefaultValue
source: New task
it: Nuova attività

source: Wellcome to Backup Task Creation Wizard!
it: Benvenuto nella procedura guidata di creazione attività backup!

# Task_Delete_Hint
source: Deletes the selected task.
it: Elimina l'attività selezionata.

source: Edits the selected backup task...
it: Modifica attività backup selezionata...

source: Would you lile to remove the backup task '{0}' ?
it: Vuoi rimuovere l'attività backup '{0}' ?

source: Run
it: Esegui

source: Backup Task '{0}'
it: Attività backup '{0}'

source: Choose the task you want to run:
it: Scegli l'attività che vuoi eseguire:

# IncrementalBackupDescription
source: The most basic form of incremental backup consists of identifying, recording and thus, preserving only those files that have changed since the last backup. Since changes are typically low, incremental backups are much smaller and quicker than full backups. For instance, following a full backup on Friday, a Monday backup will contain only those files that changed since Friday. A Tuesday backup contains only those files that changed since Monday, and so on. A full restoration of data will naturally be slower, since all increments must be restored. Should any one of the copies created fail, including the first (full), restoration will be incomplete.
it: La forma più elementare di backup incrementale consiste nell'identificare, registrare e quindi preservare solo i file che sono cambiati dall'ultimo backup. Poiché le modifiche sono generalmente limitate, i backup incrementali sono molto più piccoli e più rapidi dei backup completi. Ad esempio, dopo un backup completo di venerdì, un backup di lunedì conterrà solo i file modificati da venerdì. Un backup di martedì contiene solo i file modificati da lunedì e così via. Un ripristino completo dei dati sarà naturalmente più lento, poiché tutti gli incrementi dovranno essere ripristinati. Se una qualsiasi delle copie create dovesse fallire, inclusa la prima (completa), il ripristino risulterà incompleto.

source: Name
it: Nome

source: Name is empty.
it: Il nome è vuoto.

# Password_Generate
source: Generate password...
it: Genera password...

# BackupFailedPleaseReviewOpenedLog
source: Failed (see opened log)
it: Non riuscito (vedi registro eventi aperto)

source: Information - BUtil
it: BUtil - Informazioni

source: Error - BUtil
it: BUtil - Errore

source: Question - BUtil
it: BUtil - Domanda

# SourceItemFailure
source: Source item "{0}" does not exist. Please correct list of source items.
it: L'elemento di origine "{0}" non esiste. Correggi l'elenco degli elementi sorgenti.

source: Cannot locate file "{0}" in directory. Point to a directory containing this file.
it: Impossibile individuare il file "{0}" nella cartella. Punta ad una cartella contenente questo file.

# BackupVersion_Selector_Title
source: SELECT VERSION
it: SELEZIONA VERSIONE

source: CHANGES
it: MODIFICHE

source: FILES
it: FILE

source: Click on item you want to restore and open context menu by right click
it: Fai clic sull'elemento che si vuoi ripristinare e aprire il menu contestuale facendo clic con il tasto destro

# Password_Field_Validation_NotMatch
source: Passwords do not match.
it: Le password non corrispondono.

# Password_Help
source: Recommended minimum password length is 50 characters and more.
it: La lunghezza minima consigliata della password è di 50 caratteri e oltre.

source: Add File Exclude Pattern...
it: Aggiungi esclusione file con maschera...

source: Excludes files from backup by pattern...
it: Escludi file dal backup in base alla maschera...

source: File Exclusion Pattern:
it: Maschera esclusione file:

source: Here you can specify file globbing exclusion patterns. It can be a file name or folder name or wildcard. Examples: d:\temp, d:\temp\file.txt, d:\temp\**\*.txt or bin. See detailed description in the following link.
it: Qui è possibile specificare le maschere di esclusione file. Può essere un nome file, un nome cartella o un carattere jolly. Esempi: d:\temp, d:\temp\file.txt, d:\temp\**\*.txt or bin. Vedi la descrizione dettagliata nel seguente collegamento.

source: File globbing in .NET: Patterns
it: File inglobato .NET: maschere

source: Pattern is empty.
it: La maschera è vuota.

source: Edit File Exclude Pattern...
it: Modifica maschera esclusione file...

source: Open in Explorer...
it: Apri n Explorer...

source: Cannot open backup folder.
it: Impossibile aprire la cartella backup.

source: Restoration is completed.
it: Il ripristino è stato completato.

source: Upload limit, GB:
it: Limite upload, GB:

# UploadLimitDescription
source: Limits amount of data being sent during one backup session to storage. 0 - no limit. When backup exceeds this quota, some files will be skipped and will be backuped next time. Usage scenario: You mounted some cloud storage as disk and perform backup on it. There's a problem: ISP drops upload speed after several gigabytes. This setting allows you to handle it.
it: Limita la quantità di dati inviati allo spazio di archiviazione durante una sessione di backup. 0 - nessun limite. Quando il backup supera questa quota, alcuni file verranno ignorati e verranno sottoposti a backup la prossima volta. Scenario di utilizzo: hai montato parte dell'archivio cloud come disco ed hai eseguito il backup su di esso. C'è un problema: l'ISP riduce la velocità di caricamento dopo diversi Gigabyte. Questa impostazione ti consente di gestirlo.

source: Mount:
it: Monta:

# DataStorageStorage_Label_DisconnectionScript
source: Disconnection script:
it: Script disconnessione:

# HelpMountUnmountScript
source: If folder becomes accessible after mounting, specify PowerShell scripts for mounting and unmounting
it: Se la cartella diventa accessibile dopo il montaggio, specifica gli script PowerShell per il montaggio e lo smontaggio

source: Share name is not specified.
it: Non è stato specificato il nome condivisione.

# LastBackup
source: State
it: Stato

# StorageSize
source: Storage: {0}
it: Archivio: {0}

source: Journal: {0}
it: Diario: {0}

# JournalSelected
source: Journal for selected...
it: Diario per selezionati...

source: VERSIONS
it: VERSIONI

source: Open selected version...
it: Apri versione selezionata...

source: Recover selected...
it: Ripristina selezionati...

source: Usage variants: butilc.exe "Task=My task title" Runs specified task. butilc.exe "Task=My task title" Shutdown butilc.exe "Task=My task title" LogOff butilc.exe "Task=My task title" Reboot butilc.exe Help Outputs brief help
it: Varianti d'uso: butilc.exe "Task=Titolo attività" Esegue l'attività specificata. butilc.exe "Task=Titolo attività" Shutdown butilc.exe "Task=Titolo attività" LogOff butilc.exe "Task=Titolo attività" Reboot butilc.exe Help Visualizza una breve guida

source: Error: Invalid command parameters specified!!!
it: Errore: parametri comando specificati non validi!!!

source: Cannot open file log due to crytical error {0}
it: Impossibile aprire il registro del file a causa di un errore critico {0}

source: Please, specify the backup task title using the command line argument "{0}My backup task title" Example: butilc.exe "{0}My backup title"
it: Specifica il titolo dell'attività di backup usando l'argomento della riga di comando "{0}Titolo dell'attività di backup" Esempio: butilc.exe "{0}Titolo attività"

# Task_Validation_NotFound
source: Task '{0}' wasn't found.
it: Attività '{0}' non trovata.

source: Task has failed (see opened log)
it: L'attività non è riuscita (vedi registro eventi aperto)

source: Task is succeeded!
it: Attività completata!

source: File name transformations:
it: Trasformazione nome file:

# HelpForTokens
source: Supported tokens: {DATE:Format} - Inserts file modification date in the specified format. To see all options google "C# DateTime format".
it: Token supportati: {DATE:Format} - Inserisce la data modifica file nel formato specificato. Per vedere tutte le opzioni usa la ricerca con Google e "C# DateTime format".

# Button_Save
source: Save
it: Salva

# ImportMediaTask_Create
source: Create import media task
it: Crea attività importazione multimediale

# ImportMediaTask_Edit_Title
source: Edit "{0}" media import task
it: Modifica attività importazione multimediale "{0}".

# Field_Name_Validation
source: Name is empty or contains not supported path characters.
it: Il nome è vuoto o contiene nel percorso caratteri non supportati.

# Task_Create
source: Create
it: Crea

# Task_Launch
source: Launch
it: Esegui

# Task_Edit
source: Edit
it: Modifica

# Task_Delete
source: Delete
it: Elimina

source: Please confirm deletion of "{0}"
it: Confermare l'eliminazione di "{0}"

# Task_Edit_Validation_NoCLI
source: You cannot edit this type of task in CLI.
it: Non è possibile modificare questo tipo di attività nella CLI.

source: Specify location
it: Specifica percorso

# PortField
source: Port:
it: Porta:

# User_Field
source: User:
it: Utente:

# Field_Folder
source: Folder:
it: Cartella:

# ImportFilesFrom
source: Specify data source
it: Specifica sorgente dati

# ImportMediaTask_Help
source: Imports audios, photos, videos from SD Card of camera, recorder; photos and videos from your phone via WI-FI through FTP Server application using template file names.
it: Importa audio, foto, video dalla scheda SD della fotocamera, del registratore; foto e video dal telefono tramite WI-FI tramite l'applicazione server FTP usando i nomi file modello.

source: Skip already imported files
it: Salta i file già importati

source: Select transport
it: Seleziona trasporto
