Repository: drweb86/butil
Catalog: sources/butilc/Localization/Resources.*.resx
Languages: ru

source: Usage variants: butilc.exe "Task=My task title" Runs specified task. butilc.exe "Task=My task title" Shutdown butilc.exe "Task=My task title" LogOff butilc.exe "Task=My task title" Reboot butilc.exe Help Outputs brief help
ru: Использование: butilc.exe "Task=Заголовок задания РК" Запуск указанного задания. butilc.exe "Task=Заголовок задания РК" Shutdown butilc.exe "Task=Заголовок задания РК" LogOff butilc.exe "Task=Заголовок задания РК" Reboot Также можно запланировать выключение ПК, выход из сеанса, перезагрузку по окончании РК butilc.exe Help Выводит краткую подсказку

source: Error: Invalid command parameters specified!!!
ru: Ошибка: Указаны неверные аргументы!!!

source: To run program with this switch you should disable scheduling in options first. Please refer to manual!
ru: Чтобы запустить программу с этой опцией, вы должны отключить планирование в конфигураторе. Для деталей смотрите документацию!

source: Cannot open file log due to crytical error {0}
ru: Не могу открыть файл лога из-за критической ошибки {0}

source: Please, specify the backup task title using the command line argument "{0}My backup task title" Example: butilc.exe "{0}My backup title"
ru: Пожалуйста, укажите заголовок задания на резервное копирование через аргумент коммандной строки "{0}Мой заголовок задания на РК" Пример: butilc.exe "{0}Мой заголовок задания на РК"

source: There're no backup task with title '{0}'.
ru: Задания на резервное копирование с заголовком "{0}" не существует.

source: Close
ru: Закрыть

# BackupProcessCompletedSuccesfully
source: Backup is succeeded!
ru: Бэкап закончен успешно!

# BackupFailedPleaseReviewOpenedLog
source: Backup has failed (see opened log)
ru: Бэкап провален (посмотрите открывшийся лог)

source: Title:
ru: Название:

source: Destination folder:
ru: Папка назначения:

source: File name transformations:
ru: Преобразования имени файла:

# HelpForTokens
source: Supported tokens: {DATE:Format} - Inserts file modification date in the specified format. To see all options google "C# DateTime format".
ru: Поддерживаемые токены: {DATE:Format} - Вставляет дату модификации файла в заданном формате. Чтобы увидеть все варианты, загуглите "C# DateTime формат".

source: Save
ru: Сохранить

# SourceFolderDoesNotExist
source: Photo/Video location was not specified.
ru: Расположение Фото/Видео не указано.

source: Error
ru: Ошибка

source: Destination directory does not exist.
ru: Папка назначения не существует.

source: Transform file name is empty.
ru: Не указан шаблон имени файла.

source: Title is empty or contains not supported path characters.
ru: Заголовок пуст или содержит символы пути.

source: _Create
ru: _Создать задачу

source: _Run (F5, Enter)
ru: _Запустить (F5, ввод)

source: _Edit (F4)
ru: _Изменить (F4)

source: _Delete (F8, Del)
ru: _Удалить (F8, Del)

source: Delete
ru: Удалить

source: Please confirm deletion of "{0}"
ru: Подтвердите удаление задачи "{0}"

source: You cannot edit this type of task in CLI.
ru: Вы не можете редактировать этот тип задания здесь.
