Repository: drweb86/butil
Catalog: sources/Configurator/Localization/Resources.*.resx
Languages: ru

source: What?
ru: Что?

source: Drag and drop here files and folders which you're going to backup! For setting compression priority use menu
ru: Перетащите сюда файлы и папки в список из Проводника! Чтобы установить уровень сжатия, используйте контекстное меню

source: Add folders...
ru: Добавить папки...

source: Remove
ru: Удалить из списка

source: Add files...
ru: Добавить файлы...

source: Where?
ru: Куда?

source: Specify the folder where to store back-up:
ru: Укажите папку назначения:

source: Encryption
ru: Шифрование

source: Browse...
ru: Искать...

source: Other options
ru: Прочие настройки

source: Above normal
ru: Выше среднего

source: Normal
ru: Средний

source: Below normal
ru: Ниже среднего

source: Low
ru: Низкий

source: Choose backup priority:
ru: Выберите приоритет:

source: % (default is 60)
ru: % (по умолчанию 60)

source: Put off making backup till processor\'s loading will be less then
ru: Отложить архивирование данных, пока загруженность CPU не снизится до

source: Logging
ru: Логи

source: When?
ru: Как часто?

source: Choose days of week:
ru: Выберите дни недели:

source: Wednesday
ru: Среда

source: Thursday
ru: Четверг

source: Friday
ru: Пятница

source: Saturday
ru: Суббота

source: Tuesday
ru: Вторник

source: Monday
ru: Понедельник

source: Sunday
ru: Воскресенье

source: Minute:
ru: Минуты:

source: Hour:
ru: Часы:

source: week
ru: неделю

source: day
ru: день

source: Backup data every...
ru: Делать резерные копии каждый...

source: About
ru: О программе

source: utility for creating backups.\n\nWeb-sites: https://github.com/drweb86/butil\n\nLocalization created by:\n
ru: утилита резервного копирования\n\nВеб-сайты: https://github.com/drweb86/butil\n\nПеревод на текущий язык сделан:\n

source: Adds the new backup task...
ru: Добавляет новое задание РК...

source: Tasks
ru: Задачи

source: Runs backup...
ru: Запускает РК...

source: Configurator
ru: Конфигуратор РК

source: Start
ru: Пуск

source: Close
ru: Закрыть

source: Process priority:
ru: Приоритет обработки:

source: Wellcome to Backup Wizard!
ru: Добро пожаловать в Мастер резервного копирования!

source: Backup process completed succesfully!!!
ru: Резервное копирование успешно завершено

source: Do you really want to stop backup process?
ru: Хотите прервать процесс резервного копирования?

source: Are you sure?
ru: Вы уверены?

source: Cancel
ru: Отмена

source: Elapsed:
ru: Прошло:

source: Backup is in a progress...
ru: Идёт резервное копирование...

source: Would you like to apply modified settings?
ru: Применить изменения в настройках?

source: Exiting...
ru: Выход...

source: Settings
ru: Настройки

source: Choose logging level:
ru: Выберите уровень ведения логов:

source: Documentation
ru: Руководство пользователя

source: SUPPORT
ru: ПОДДЕРЖКА

source: BUG REPORT
ru: ОШИБКА

source: Error
ru: Ошибка

source: Was asked to update options
ru: Пришла команда обновить настройки

source: Could not continue work after getting options because {0}
ru: Не могу продолжать работать с новыми настройками, так как:

source: The best choice is "low" in almost all cases
ru: Обычно, наиболее комфортен вариант "Низкий"

source: Cannot execute required manipulations with server\n
ru: Не могу выполнить требуемые манипуляции с службой

source: HDD Storage Configuration
ru: Конфигурация хранилища на жестком диске

source: Title
ru: Заголовок

source: Options
ru: Настройки

source: Remove from list
ru: Удалить из списка

source: Modify...
ru: Изменить...

source: Add
ru: Добавить

source: Open logs folder in Explorer...
ru: Посмотреть логи в Проводнике...

source: Storage name:
ru: Заголовок:

source: 1. Backup should be password protected. If NOT, program will SKIP its copying to this storage\n2. Your authorization information is going over the network in UNPROTECTED mode(as plain text).
ru: 1. Резервная копия должна быть защищена паролем. Если НЕ БУДЕТ, программа ПРОПУСТИТ копирование в это хранилище\n2. Ваши авторизационные данные в открытом виде будут распространятся по сети в незащищенном виде.

source: Destination folder
ru: Папка назначения

source: Authorization information
ru: Авторизация:

source: User:
ru: Пользователь:

source: Password:
ru: Пароль:

source: FTP server
ru: ФТП сервер

source: Active
ru: Активный

source: Passive
ru: Пассивный

source: Data transfer mode:
ru: Режим передачи данных:

source: Dns name or IP: ftp://
ru: Dns имя или IP: ftp://

source: Test
ru: Тест

source: FTP Storage Configuration
ru: Настройки ФТП Хранилища

source: Works fine!
ru: Работает отлично!

source: Hard drive storage...
ru: Хранилище на жестком диске

source: Ftp storage...
ru: Хранилище на ФТП сервере

source: Beep several times
ru: Подать звуковой сигнал

source: After completion of backup
ru: По окончании резервного копирования

source: Shutdown PC
ru: Выключить компьютер

source: Log Off
ru: Завершить мой сеанс

source: Suspend PC
ru: Перевести ПК в спящий режим

source: Hibernate PC
ru: Перевести ПК в режим Hibernate

source: Do nothing
ru: Ничего не делать

source: Set compression degree
ru: Установить степень сжатия

source: Items to backup
ru: Объекты для резервного копирования

source: Finish
ru: Закончить

source: Recover!
ru: Восстановить!

source: Use right-click mouse on selected item to restore it
ru: Используйте правый щелчок мышкой по выбранному объекту, чтобы восстановить его

source: If your backup is password protected, please type password here:
ru: Если ваша резервная копия защищена паролем, укажите его здесь:

source: Continue >
ru: Продолжить >

source: Restoration master
ru: Мастер восстановления

source: Network storages are not allowed to be pointed here!
ru: Сетевые ресурсы НЕ МОГУТ указываться здесь!

source: Network storage...
ru: Сетевое хранилище...

source: Target folder should have UNC name(for example:\\server1\sharedResource1)!
ru: Папка назначения должна иметь UNC имя(к примеру \\сервер1\расшаренныйРесурс1)!

source: Network Storage Configuration
ru: Конфигурация Сетевого Хранилища

source: Network places are not allowed to be added to the list of backup items!
ru: Сетевые пути нельзя добавлять в список объектов для резервного копирования!

source: Restore Data...
ru: Восстановить данные...

source: Scheduling
ru: Планировщик

source: Important:\n\nBackup should be password protected. If NOT, program will SKIP its copying to this storage
ru: Внимание:\n\nРезервная копия должна быть защищена паролем. Если НЕ БУДЕТ - то программа ПРОПУСТИТ копирование данных в такое хранилище

source: HDD
ru: Жесткий диск

source: FTP
ru: ФТП

source: Network storages
ru: Сеть

source: If you choose something other than 'do nothing' \nprogram will configure OS to show you report\non next your logon to the system if any errors \nor warnings will be registered during the backup
ru: Если вы выберите что-либо кроме "ничего не делала", программа \nнастроит ОС таким образом, чтобы был показан отчет об РК\nпри следующим вашем входе в систему если \nбудут зарегестрированы ошибки или предупреждения.

source: Please wait...
ru: Подождите, пожалуйста...

source: Additional encryption under your local system account. \nRequires NTFS file system and win2k OS on remote machine. Backup data will be available only for your OS account. See documentation for details
ru: Дополнительное шифрование под вашей учетной записью.\nТребует наличия файловой системы NTFS и Win2k на удаленной машине. Резервная копия будет доступна только вашей учетной записи. Смотрите документацию для подробностей

source: While backup is in progress you can continue work. \n\nTo restore progress form just click on this icon in tray
ru: Пока создается резервная копия, вы можете продолжить работу\n\nЧтобы отобразить форму, кликните по иконке в трее

source: Skip copying and write a warning into log if backup exceeds
ru: Не копировать и заносить предупреждение в лог, если размер резервной копии превысит

source: Backup
ru: Резервное копирование

source: {0} day(s) {1} h : {2} min : {3} sec
ru: {0} дн {1} ч : {2} мин : {3} сек

source: {0} h : {1} min : {2} sec
ru: {0} ч : {1} мин : {2} сек

source: {0} min : {1} sec
ru: {0} мин : {1} сек

source: {0} sec
ru: {0} сек

source: Backup is in progress...
ru: Идет резервное копирование...

source: There are no items to backup!\n\nYou can specify the data to backup in Configurator in 'What' settings group.
ru: Не указаны объекты для резервного копирования!\n\nЧтобы указать их, запустите Конфигуратор и добавьте файлы и папки в вкладке "Что?"

source: There are no specified places where to store backup!\n\nYou can add some storages in Configurator in 'Where' settings group.
ru: Не указано ни одно хранилище данных для резервных копий!\n\nЧтобы указать хранилище, запустите Конфигуратор и во вкладке "Куда?" добавьте минимум одно хранилище.

source: Here you may add folders and files you want to backup
ru: Сюда можете добавлять файлы и папки, предназначенные для резервного копирования

source: In this place you can add locations where you would like your backup to be copied after completion of backup
ru: Здесь можно указать места, в которые Вы хотите чтобы резервная копия была помещена после резервного копирования

source: Here you can set up a scheduler. Shceduler can help you to automate creation of backups
ru: Здесь можно настроить планировщик. Планировщик позволяет автоматизировать создание резервных копий

source: Protection of backup with password. It is required when you want your data to be copied somewhere over the network/
ru: Защита резервной копии паролем. Данные должны быть защищены паролем, если вы хотите, чтобы программа их копировала по сети

source: Miscellaneous options
ru: Разные настройки

source: Here you can set up logging properties
ru: Здесь настраивается протоколирование и можно посмотреть логи

source: Check For Updates...
ru: Проверить обновления...

source: New {0} version is available.\n\nChanges are:\n{1}\n\nProgram will now open browser with the download page
ru: Доступна новая {0} версия.\n\nВ этой версии:\n{1}\n\nСейчас программа откроет броузер со страничкой загрузки программы

source: You have the latest version!
ru: У вас последняя версия!

source: Review log of last backup...
ru: Посмотреть лог последнего резервного копирования...

source: hide 'About' tab
ru: спрятать вкладку "О программе"

source: Misc
ru: Прочее

source: In Progress...
ru: Обработка...

source: Waiting...
ru: Ожидание...

source: Finished Succesfully
ru: Завершилась успешно

source: Finished With Errors
ru: Завершилась с ошибками

source: Processing State
ru: Состояние Обработки

source: Cannot run 7zg.exe because {0}
ru: Не получается запустить 7zg.exe, поскольку {0}

source: Backup journals
ru: Журналы резервного копирования

source: Errors and warnings will be saved in logs
ru: Ошибки и предупреждения будут сохраняться в логах

source: This mode is for getting support
ru: Этот режим предназначен для получения поддержки, связанной с предоставлением логов

source: View selected logs...
ru: Посмотреть выбранные логи...

source: Remove selected logs
ru: Удалить выбранные логи

source: Remove succesfull logs
ru: Удалить логи успешного РК

source: Succesfull
ru: Успешные

source: Erroneous
ru: С ошибками

source: Unknown
ru: С неопределенным статусом

source: Refresh
ru: Обновить

source: Please, check items to compress!
ru: Выберите по меньшей мере один файл или папку для сжатия!

source: Please, check storages where to copy backup image!
ru: Выберите по меньшей мере одно хранилище, куда будет помещен образ РК!

source: Amount of storages to process synchronously:
ru: Количество хранилищ, которые обрабатывать параллельно:

source: Reboot
ru: Перезагрузка

source: Amount of 7-zip processes to run synchronously:
ru: Количество процессов 7-zip, которые запускать одновременно:

source: BUtil software package component '{0}' is missing.\n\nPlease reinstall application.\n\nRestoration, Backup and Help functions will be unavailable.
ru: Компонент приложения BUtil "{0}" не найден.\n\nПожалуйста, переустановите приложение.\n\nФункции Восстановления, Резервного копирования и Помощи будут недоступны.

source: Invalid argument(s) passed to the program.\n\nPlease refer to manual for the complete list of parameters!
ru: Неверные аргументы переданы программе.\n\nОбратитесь к руководству пользователя, если хотите посмотреть весь список корректных аргументов!

source: New Event Task - Configurator
ru: Новое задание - Конфигуратор

source: Editing Event Task - Configurator
ru: Изменение задания - Конфигуратор

source: Task to run
ru: Задание для выполнения

source: Program:
ru: Программа:

source: Command line arguments:
ru: Аргументы коммандной строки:

source: Chain of programs to execute BEFORE backup
ru: Цепочка программ для выполнения ДО резервного копирования

source: Chain of programs to execute AFTER backup
ru: Цепочка программ для выполнения ПОСЛЕ резервного копирования

source: Edit...
ru: Изменить...

source: Move Up
ru: Переместить выше

source: Move Down
ru: Переместить ниже

source: Logs location:
ru: Расположение журналов:

source: ● Change logs location
ru: ● Изменить месторасположение журналов

source: ● Restore default logs location
ru: ● Восстановить место хранения журналов по умолчанию

source: Actions
ru: Действия

source: Help
ru: Помощь

source: New Backup Task Title
ru: Заголовок Нового Задания

source: Wellcome to Backup Task Creation Wizard!
ru: Добро пожаловать в Мастер добавления задания на РК!

source: This master will help you to create a new task
ru: Этот мастер поможет Вам создать новое задание на РК

source: Here you may add files and folders you wanna to backup
ru: Добавьте файлы и папки, РК которых хотите сделать

source: Here you can specify where to send backups
ru: Хранилища резервных копий

source: You can set days and times when you want to start this backup job
ru: Здесь вы можете установить дни недели, когда вы хотите чтобы это задание на РК было запущено

source: Here you can protect the backup with password (this is also required for copying it over network)
ru: Здесь вы можете защитить РК паролем (защита обязательна если вы хотите исопльзовать сетевые хранилища)

source: Here you can specify other settings
ru: Здесь можно указать другие настройки

source: New Backup Task Wizard
ru: Мастер добавления нового задания на РК

source: Next >
ru: Далее >

source: < Back
ru: < Назад

source: Removes the selected backup task...
ru: Удаляет выбранное задание РК...

source: Edits the selected backup task...
ru: Изменяет выбранное задание РК...

source: Would you lile to remove the backup task '{0}' ?
ru: Хотите удалить задание РК "{0}"?

source: Backup tasks
ru: Задания РК

source: Run
ru: Пуск

source: Backup Task '{0}'
ru: Задание Резервного Копирования "{0}"

source: Save and Run
ru: Сохранить и запустить

source: Choose the task you want to run:
ru: Выберите задание РК для запуска:

source: ● Open Logs
ru: ● Посмотреть логи

# TranslationAuthor
source: Copyright (c) 2007-2008 Kuchuk Siarhei Alexandrovich, Cuchuk.Sergey@gmail.com
ru: Copyright (c) 2010 Siarhei, Cuchuk.Sergey@gmail.com
